Filip83/ecos-devel/ecos-3.0/packages/devs/usb/kinetis/current/src/usbc_kinetis.c
/******************************************************************************
 *   Functions to process setup packet.                                       *
 ******************************************************************************/

usbs_control_return
usbs_parse_host_get_command (usbs_control_endpoint * pcep)
{
    usbs_control_return retcode;
    cyg_uint8 dev_req_type =
      (((usb_devreq *) pcep->control_buffer)->type) & USB_DEVREQ_TYPE_MASK;

    switch (dev_req_type) {
    case USB_DEVREQ_TYPE_STANDARD:
        if (!pcep->standard_control_fn) {
          return usbs_handle_standard_control (pcep);
        }

        retcode =
          (*pcep->standard_control_fn) (pcep, pcep->standard_control_data);

        if (retcode == USBS_CONTROL_RETURN_UNKNOWN) {
          return usbs_handle_standard_control (pcep);
        }
        return retcode;

    case USB_DEVREQ_TYPE_CLASS:
        if (!pcep->class_control_fn) {
          return USBS_CONTROL_RETURN_STALL;
        }
        return (*pcep->class_control_fn) (pcep, pcep->class_control_data);

    case USB_DEVREQ_TYPE_VENDOR:
        if (!pcep->class_control_fn) {
            return USBS_CONTROL_RETURN_STALL;
        }
        return (*pcep->class_control_fn) (pcep, pcep->vendor_control_data);

    case USB_DEVREQ_TYPE_RESERVED:
        if (!pcep->reserved_control_fn) {
            return USBS_CONTROL_RETURN_STALL;
        }
        return (*pcep->reserved_control_fn) (pcep, pcep->reserved_control_data);
    default:
        return USBS_CONTROL_RETURN_STALL;
    }
}

// Handle a get status setup message on the control end point
 usb_status_t
usbs_kinetis_control_setup_get_status(void)
{
    usb_status_t status = kStatus_USB_Error;
    usb_devreq *req = (usb_devreq *)ep0.control_buffer;
    cyg_uint8 recipient = req->type & USB_DEVREQ_RECIPIENT_MASK;
    cyg_uint16 word = 0;

    switch (recipient) {
    case USB_DEVREQ_RECIPIENT_DEVICE:
    case USB_DEVREQ_RECIPIENT_INTERFACE:
        status = kStatus_USB_Success;
      break;
    case USB_DEVREQ_RECIPIENT_ENDPOINT:
        if ((ep0.state == USBS_STATE_CONFIGURED) &&
            (req->index_lo > 0) &&
            (req->index_lo < CYGNUM_DEVS_USB_KINETIS_CONFIG_ENDPOINTS)) {
            
            word = (cyg_uint16)kinetis_usb_device.endpointState[(((req->index_lo) & USB_ENDPOINT_NUMBER_MASK) << 1U) |
                                                (((req->index_lo) &
                                                  USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_MASK) >>
                                                 USB_DESCRIPTOR_ENDPOINT_ADDRESS_DIRECTION_SHIFT)]
                                .stateUnion.stateBitField.stalled == 1U) ?
                            kUSB_DeviceEndpointStateStalled :
                            kUSB_DeviceEndpointStateIdle;
            status = kStatus_USB_Success;
        }
      break;
    default:
        status = kStatus_USB_InvalidRequest;
    }

    *((cyg_uint16*)uep0.control_buffer) = word;
    ep0.buffer_size = sizeof (word);
    return status;
  }

// Handle a get status set feature message on the control endpoint
usb_status_t
usbs_kinetis_control_setup_set_feature(void)
{
    usb_status_t status;
    usb_devreq *req = (usb_devreq *)ep0.control_buffer;
    cyg_uint8 recipient = req->type & USB_DEVREQ_RECIPIENT_MASK;
 
    status = kStatus_USB_InvalidRequest;

    switch(recipient) {
    case USB_DEVREQ_RECIPIENT_DEVICE:
        break;
    case USB_DEVREQ_RECIPIENT_INTERFACE:
        // Nothing to do
        break;
    case USB_DEVREQ_RECIPIENT_ENDPOINT:
        /* Set or Clear the endpoint featrue. */
        if (USB_REQUEST_STANDARD_FEATURE_SELECTOR_ENDPOINT_HALT == setup->wValue)
        {
            /* Set or Clear the control endpoint status(halt or not). */

            USB_DeviceKhciControl(&kinetis_usb_device,
                    kUSB_DeviceControlEndpointStall, req->index_lo);

        }
        else
        {
        }
        break;
    default:
        status = kStatus_USB_InvalidRequest  ;
    }
    return status;
}

// Handle a get status clear feature message on the control endpoint
usb_status_t
usbs_kinetis_control_setup_clear_feature(void)
{
    usb_status_t status;
    usb_devreq *req = (usb_devreq *)ep0.control_buffer;
    cyg_uint8 recipient = req->type & USB_DEVREQ_RECIPIENT_MASK;

    status = kStatus_USB_InvalidRequest;

    switch (recipient) {
    case USB_DEVREQ_RECIPIENT_DEVICE:
        status = kStatus_USB_InvalidRequest;
        break;
    case USB_DEVREQ_RECIPIENT_INTERFACE:
        // Nothing to do
        break;
    case USB_DEVREQ_RECIPIENT_ENDPOINT:
        /* Set or Clear the endpoint featrue. */
        if (USB_REQUEST_STANDARD_FEATURE_SELECTOR_ENDPOINT_HALT == setup->wValue)
        {
            /* Set or Clear the control endpoint status(halt or not). */

            USB_DeviceKhciControl(&kinetis_usb_device,
                    kUSB_DeviceControlEndpointUnstall, req->index_lo);

        }
        else
        {
        }
      break;
    default:
        status = kStatus_USB_InvalidRequest;
    }
    return status;
}

// Handle a setup message from the host
usb_status_t
usbs_kinetis_control_setup(usb_status_t status)
{
    // Data are in control_buffer
    usb_devreq *req = (usb_devreq *) ep0.control_buffer;
    cyg_uint8   protocol;
    cyg_uint16 length;
    cyg_bool dev_to_host;
    usbs_control_return usbcode;
    cyg_bool handled = false;
    
    length = (req->length_hi << 8) | req->length_lo;
    dev_to_host = req->type & USB_DEVREQ_DIRECTION_IN;

    CYG_TRACE0( true, "Control Setup\n" );

    status = UDD_EPCTRL_SETUP;

    protocol = req->type & (USB_DEVREQ_TYPE_MASK);

    if (protocol == USB_DEVREQ_TYPE_STANDARD) {
        handled = true;
        switch (req->request) {
            case USB_DEVREQ_GET_STATUS:
                status = usbs_kinetis_control_setup_get_status();
                break;
            case USB_DEVREQ_SET_ADDRESS:
                CYG_TRACE0( true, "Control Setup Set Addr\n" );
                usb_address = req->value_lo;
                USB_DeviceKhciControl(&kinetis_usb_device,
                        kUSB_DeviceControlSetDeviceAddress,&usb_address);
                ep0.state = USBS_STATE_ADDRESSED;
                usbs_sate_noftify(&ep0);
              break;
            case USB_DEVREQ_SET_FEATURE:
                status = usbs_kinetis_control_setup_set_feature();
                break;
            case USB_DEVREQ_CLEAR_FEATURE:
                status = usbs_kinetis_control_setup_clear_feature();
                break;
            default:
                handled = false;
        }
    }
    
    if ((protocol != USB_DEVREQ_TYPE_STANDARD) || !handled) 
    {
        // Ask the layer above to process the message
        // TODO: Neni to asi idealni
        usbcode = usbs_parse_host_get_command (&ep0);
        ep0.buffer_size = MIN (ep0.buffer_size, length);
        if (usbcode == USBS_CONTROL_RETURN_HANDLED)
        {
            handled = true;
            if(ep0.fill_buffer_fn)
            {
                cyg_uint32 pos = 0;
                memcpy(kinetis_usb_device.setupPacketBuffer,
                       ep0.buffer,ep0.buffer_size);
                pos += ep0.buffer_size;
                while(ep0.fill_buffer_fn)
                {
                    if((ep0.buffer_size + pos) < USB_SETUP_PACKET_SIZE)
                    {
                        (*ep0.fill_buffer_fn) (&rp0);
                        memcpy(kinetis_usb_device.setupPacketBuffer + pos,
                               ep0.buffer,ep0.buffer_size);
                        pos += ep0.buffer_size;
                    }
                    else
                    {
                        CYG_ASSERT(false,"USB control buffer overflow\n");
                    }					
                }		

